{"/about/":{"data":{"":"To be added."},"title":"About"},"/news/abhishek-google-india-research-award-2024/":{"data":{"":"We are thrilled to announce that Prof. Abhishek Bichhawat has been awarded the Google India Research Award 2024 primarily for the work “Towards a Secure and Private Web Browsing Experience”. Kudos to the team!"},"title":"Google India Research Award 2024 goes to Prof. Abhishek Bichhawat!"},"/news/gayatri-google-phd-fellowship/":{"data":{"":"We are thrilled to announce that Gayatri Priyadarsini Kancherla has been awarded the Google PhD Fellowship 2025 in the area of Privacy, Safety, and Security. Congratulations to Gayatri for this prestigious recognition!\nFor more details, visit: https://research.google/programs-and-events/phd-fellowship/recipients/"},"title":"Gayatri got the Google PhD Fellowship 2025!"},"/news/gayatri-pets25/":{"data":{"":"We are delighted to announce that Gayatri’s work “Johnny can’t revoke consent either: measuring compliance of consent revocation on the web” has been published at the Privacy Enhancing Technologies Symposium 2025."},"title":"Gayatri presented her work at PETS 2025"},"/news/gayatri-web-conf25/":{"data":{"":"We are delighted to announce that Gayatri’s work “Least Privilege Access for Persistent Storage Mechanisms in Web Browsers” has been published at the Web Conference 2025."},"title":"Gayatri's Work Accepted at WWW 2025"},"/people/":{"data":{"":"Faculty Prof. Abhishek Bichhawat Assistant Professor\nFormal Methods \u0026 Verification | Web Security | Usable Security Abhishek Bichhawat is an Assistant Professor in the Department of Computer Science and Engineering at IIT Gandhinagar. Previously, he spent three years as a postdoctoral fellow at Cylab, Carnegie Mellon University after he completed his PhD working with Christian Hammer and Deepak Garg at Saarland University, Germany where he was affiliated with CISPA and the International Max Planck Research School for Computer Science. Prior to that he completed his Masters from Indian Insitute of Technology Roorkee and his Bachelors from Anna University. Before joining the PhD program, he worked as a Member of Technical Staff at Oracle India Pvt. Ltd. in Bengaluru, India. Ph.D. Gayatri Priyadarsini Kancherla 5th Year Ph.D.\nJuly 2021 - Present\nWeb Privacy | Browser Security | Usable Consent Sreyashi Karmakar 2nd Year Ph.D.\nJuly 2024 - Present\nBlockchain Security | Post-Quantum Cryptography | Zero-Knowledge Proofs Krupa Rajani 2nd Year Ph.D.\nJuly 2024 - Present\nNetwork Security | Modern Cryptography | Blockchain Technologies Subhrajit Das 1st Year Ph.D.\nJuly 2023 - Present\nParallelism | Usable Security M.Tech. Past Members"},"title":"People"},"/projects/":{"data":{"":"To be added."},"title":"Projects"},"/publications/":{"data":{"":"","2010#2010":"A survey on issues in mobile grid computing A Bichhawat, RC Joshi\nInt J Recent Trends Eng. Technol 4 (2), 2010","2011#2011":"Security architecture for virtual machines U Tupakula, V Varadharajan, A Bichhawat\nInternational Conference on Algorithms and Architectures for Parallel …, 2011\nProactive Fault Tolerance Technique for a Mobile Grid Environment A Bichhawat, RC Joshi\nInternational Conference on Advances in Computing and Communication, 2011","2014#2014":"Information flow control in WebKit’s JavaScript bytecode A Bichhawat, V Rajani, D Garg, C Hammer\nInternational conference on principles of security and trust, 2014\nGeneralizing permissive-upgrade in dynamic information flow analysis A Bichhawat, V Rajani, D Garg, C Hammer\nProceedings of the Ninth Workshop on Programming Languages and Analysis for Security, 2014\nException handling for dynamic information flow control A Bichhawat Companion Proceedings of the 36th International Conference on Software …, 2014","2015#2015":"Information flow control for event handling and the DOM in web browsers V Rajani, A Bichhawat, D Garg, C Hammer\n2015 IEEE 28th Computer Security Foundations Symposium, 2015\nPost-dominator analysis for precisely handling implicit flows A Bichhawat\nIEEE/ACM 37th IEEE International Conference on Software Engineering, 2015","2017#2017":"WebPol: Fine-grained information flow policies for web browsers A Bichhawat, V Rajani, J Jain, D Garg, C Hammer European Symposium on Research in Computer Security, 2017\nPractical dynamic information flow control A Bichhawat Saarländische Universitäts-und Landesbibliothek, 2017","2020#2020":"Contextual and granular policy enforcement in database-backed applications A Bichhawat, M Fredrikson, J Yang, A Trehan\nProceedings of the 15th ACM Asia Conference on Computer and Communications Security, 2020\nFirst-order Gradual Information Flow Types with Gradual Guarantees A Bichhawat, MK McCall, L Jia\narXiv preprint arXiv:2003.12819, 2020","2021#2021":"DY*: A Modular Symbolic Verification Framework for Executable Cryptographic Protocol Code Karthikeyan Bhargavan, Abhishek Bichhawat, Quoc Huy Do, Pedram Hosseyni, Ralf Küsters, Guido Schmitz, Tim Würtele\n2021 IEEE European Symposium on Security and Privacy (EuroS\u0026P), 2021\nAn in-depth symbolic security analysis of the ACME standard Karthikeyan Bhargavan, Abhishek Bichhawat, Quoc Huy Do, Pedram Hosseyni, Ralf Küsters, Guido Schmitz, Tim Würtele\nProceedings of the 2021 ACM SIGSAC conference on computer and communications security, 2021\nSAFETAP: An efficient incremental analyzer for trigger-action programs McKenna McCall, Faysal Hossain Shezan, Abhishek Bichhawat, Camille Cobb, Limin Jia, Yuan Tian, Cooper Grace, Mitchell Yang\nCarnegie Mellon University, 2021\nGradual security types and gradual guarantees A Bichhawat, MK McCall, L Jia\n2021 IEEE 34th Computer Security Foundations Symposium (CSF), 2021\nA Tutorial-Style Introduction to DY* Karthikeyan Bhargavan, Abhishek Bichhawat, Quoc Huy Do, Pedram Hosseyni, Ralf Küsters, Guido Schmitz, Tim Würtele\nProtocols, Strands, and Logic: Essays Dedicated to Joshua Guttman on the Occasion of his 66.66 th Birthday, 2021\nPermissive runtime information flow control in the presence of exceptions A Bichhawat, V Rajani, D Garg, C Hammer\nJournal of Computer Security 29 (4), 2021\nDY⋆ Code Repository Karthikeyan Bhargavan, Abhishek Bichhawat, Quoc Huy Do, Pedram Hosseyni, Ralf Küsters, Guido Schmitz, Tim Würtele\nURL: https://github. com/reprosec/dolev-yao-star, 2021\nAutomating Audit with Policy Inference A Bichhawat, M Fredrikson, J Yang\n2021 IEEE 34th Computer Security Foundations Symposium (CSF), 2021","2022#2022":"Noise: A library of verified high-performance secure channel protocol implementations S Ho, J Protzenko, A Bichhawat, K Bhargavan 2022 IEEE Symposium on Security and Privacy (SP), 2022\nCompositional information flow monitoring for reactive programs MK McCall, A Bichhawat, L Jia 2022 IEEE 7th European Symposium on Security and Privacy (EuroS\u0026P), 2022","2023#2023":"Towards Usable Security Analysis Tools for {Trigger-Action} Programming McKenna McCall, Eric Zeng, Faysal Hossain Shezan, Mitchell Yang, Lujo Bauer, Abhishek Bichhawat, Camille Cobb, Limin Jia, Yuan Tian Nineteenth Symposium on Usable Privacy and Security (SOUPS 2023), 2023\nLayered Symbolic Security Analysis in Karthikeyan Bhargavan, Abhishek Bichhawat, Pedram Hosseyni, Ralf Küsters, Klaas Pruiksma, Guido Schmitz, Clara Waldmann, Tim Würtele European Symposium on Research in Computer Security, 2023\nTainted Secure Multi-Execution to Restrict Attacker Influence MK McCall, A Bichhawat, L Jia Proceedings of the 2023 ACM SIGSAC Conference on Computer and Communications Security, 2023","2024#2024":"Online Authentication Habits of Indian Users P Choudhary, S Das, MP Potta, P Das, A Bichhawat 2024 Conference on Building a Secure \u0026 Empowered Cyberspace (BuildSEC), 2024\nWeb Privacy Perceptions Amongst Indian Users G Priyadarsini, A Saxena, A Dey, Prakriti, A Bichhawat International Conference on Information Systems Security, 2024","2025#2025":"Johnny can’t revoke consent either: measuring compliance of consent revocation on the web GP Kancherla, N Bielova, C Santos, A Bichhawat Proceedings on Privacy Enhancing Technologies, 2025\nHow Usable is Consent Withdrawal on the Web? UI Requirements and Expert Evaluation S Ahuja, GP Kancherla, CT Santos, N Bielova, A Bichhawat HAL open science, 2025\nLeast Privilege Access for Persistent Storage Mechanisms in Web Browsers GP Kancherla, D Goel, A Bichhawat Proceedings of the ACM on Web Conference 2025, 2025\nA Unified Browser-Based Consent Management Framework GP Kancherla, A Bichhawat 47th International Conference on Software Engineering: New Ideas and Emerging Results (ICSE-NIER), 2025\nOn the Prevalence and Usage of Commit Signing on GitHub: A Longitudinal and Cross-Domain Study A Sharma, S Karmakar, GP Kancherla, A Bichhawat Evaluation and Assessment in Software Engineering (EASE) 2025, 2025\nWorst-Case Response Time Analysis for Periodic Programs with Nested Locks HM Ramolia, SS Kanawade, A Bichhawat Proceedings of the 18th Innovations in Software Engineering Conference, 2025","misc#Misc.":"Restricting Attacker Influence in Reactive Programs with Dynamic Secrets MK McCall, A Bichhawat, L Jia\nCarnegie Mellon University\nPoster: Security in Web-Based Workflows Thomas Bauereiß, Abhishek Bichhawat, Iulia Bolosteanu, Peter Faymonville, Bernd Finkbeiner, Deepak Garg, Richard Gay, Sergey Grebenshchikov, Christian Hammer, Dieter Hutter, Ondrej Kuncar, Peter Lammich, Heiko Mantel, Christian Müller, Andrei Popescu, Markus Rabe, Vineet Rajani, Helmut Seidl, Markus Tasch, Leander Tentrup\nStatus Report: Formal Analysis of Web Security K Bhargavan, A Bichhawat, QH Do, D Fett, R Küsters, G Schmitz"},"title":"Publications"}}